[
    {
        "name": "KPMG",
        "link": "https://kpmg.com/jp/en/home/about/kit.html",
        "title": "Software Engineer Intern",
        "image": "kpmg",
        "date": "May 2022 - August 2023",
        "location": "Tokyo, Japan",
        "summary": "Led multifaceted initiatives including the development of efficient file comparison software, innovative PDF algorithms, proactive security measures, comprehensive testing frameworks, and performance-enhancing microservices, fostering a culture of knowledge-sharing and transparency within the company.",
        "work": [
            "● Led and delivered a file comparison software (Python) surpassing Adobe's with 48% more accuracy and 60% faster processing.",
            "● Led 95% of app security bug reduction by enforcing secure coding practices and upgrading Python with 100+ dependencies.",
            "● Achieved 30-50% faster audit processing by implementing a distributed cache service (Python), boosting auditor efficiency.",
            "● Enhanced financial auditing accuracy by 35% using patented Python algorithms, optimizing PDF data extraction.",
            "● Tested 1000+ REST API endpoints by developing a Clojure-based property testing framework under tight deadlines.",
            "● Streamlined Azure deployments with systematic CI/CD pipelines, Kubernetes configurations, and refined SDLC measures.",
            "● Improved divisional transparency by hosting 20+ company-wide knowledge-sharing sessions, engaging over 70% of staff."
        ],
        "technologies": "Django, Python, Clojure, Automated Testing, Algorithms, Kubernetes, Docker, Microservices, KEDA, Distrubuted Systems"
    },
    {
        "name": "Rutgers, Shumyatsky Lab",
        "link": "https://sites.rutgers.edu/shumyatsky-lab/",
        "title": "Research Assistant",
        "image": "rutgers",
        "date": "May 2021 - May 2022",
        "location": "New Jersey, USA",
        "summary": "Led the creation of a Python, OpenCV, and Arduino-based software platform facilitating Optogenetics experiments, enhancing automation, and improving efficiency for researchers with non-technical backgrounds.",
        "work": [
            "● Reduced Optogenetics experiment time by 83% through developing Python software to automate the experimental process.",
            "● Automated 60+ hours of video analysis by implementing machine learning pipelines using DeepLabCut and EzTrack.",
            "● Achieved a 93% cost reduction by creating an in-house Arduino-based device to replace the existing TTL pulse generator."
            
        ],
        "technologies": "Python, OpenCV, Arduino, Statistical Data Analysis"
    },
    {
        "name": "Whiz.ai",
        "link": "https://www.whiz.ai/",
        "title": "Software Engineer Intern",
        "image": "whizai",
        "date": "November 2021 - January 2022",
        "location": "New Jersey, USA and Pune, India",
        "summary": "Enhanced API efficiency and reduced database latency by implementing Python-based back-end optimizations, intermediate caching, Alembic integration, and global support for machine learning engineers in an agile environment.",
        "work": [
            "● Optimized back-end functionality (Python, Flask) to support language models resulting in a 30% decrease in API latency.",
            "● Developed and onboarded the entire team to utilize Python tool for streamlined database migrations with Alembic API."
        ],
        "technologies": "Python, Databases, Flask, REST APIs, Language Models, Microservices"
    },
    {
        "name": "HealCo Inc.",
        "link": "https://healco.us/",
        "title": "Full Stack Engineer Intern",
        "image": "healco",
        "date": "May 2020 - February 2021",
        "location": "New Jersey, USA",
        "summary": "Architected and deployed HealCo's feature-rich press release web app, orchestrated a scalable DevOps system, executed a codebase migration to TypeScript, and integrated Stripe for payment functionality.",
        "work": [
            "● Architected, developed, and deployed HealCo’s press release web app with robust identity access management, press sharing functionality, and administrative features using NextJS, TypeScript, PostgreSQL, Twilio, SendGrid, and Stripe.",
            "● Built a production-grade, scalable, and cost-effective DevOps system and CI/CD pipeline for all HealCo apps using AWS, Docker, and GitLab CI/CD.",
            "● Migrated the entire codebase from JavaScript to TypeScript to reduce bugs and improve maintainability.",
            "● Rapidly created and deployed web application features for hospitals to lease medical spaces during the COVID-19 pandemic.",
            "● Integrated Stripe into the web application to enable payments by ACH debits and credit cards."
        ],
        "technologies": "AWS, Node.js, Next.js, React.js, Typescript, Javascript, MySQL, PostgreSQL, Docker, Microservices"
    },
    {
        "name": "Ziplyne Inc.",
        "link": "https://www.ziplyne.com/",
        "title": "Software Engineer Intern",
        "image": "ziplyne",
        "date": "May 2019 - September 2019",
        "location": "New Jersey, USA",
        "summary": "Played a pivotal role in overhauling the company's digital presence, integrating third-party tools, and enhancing product visibility to drive sales analytics for Ziplyne.",
        "work": [
            "● Collaborated with the CEO, CMO, UI/UX designers, and senior developers to assist in the company redesign.",
            "● Rebuilt the company website with third party webhook integrations and also worked on designing parts of the main product using React.js.",
            "● Used 3rd party snippets and API integrations to improve web functionality and increase product visibility which aided the Ziplyne team with sales analytics."
        ],
        "technologies": "AWS, React.js, Typescript, Javascript, Docker"
    },
    {
        "name": "Quakerbridge Hacks",
        "link": "https://rohan2002.github.io/QBHacks/",
        "title": "Founder and President",
        "image": "qbhacks",
        "date": "2019",
        "location": "New Jersey, USA",
        "summary": "Founded and led the 12-Hour Hackathon in Trenton, NJ, taking charge of all aspects of event planning, including marketing, finance, logistics, sponsorship, and venue coordination.",
        "work": [
            "● President and Founder of 12-Hour Hackathon in Trenton, NJ",
            "● Oversaw all aspects of event planning, demonstrating strong leadership principles in marketing, finance, logistics, sponsorship, and venue coordination."
        ],
        "technologies": "Communication, Empathy, Leadership"
    }
]